#### TableViewUIUtils Members

---

|  |
| --- |
| TableViewUIUtils Class   Methods   See Also |

The  TableViewUIUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | TestCellAndPromptToEditTypeParameter | Prompts the end-user to control whether a type parameter contained in the specified table cell should be allowed edited. |

# See Also

TableViewUIUtils Class

Autodesk.Revit.UI Namespace